[
    {
        "alias": "ARTD",
        "analysis": "<p>Entries in <em>Art and design subjects</em> have decreased a little across the UK over the last four years. The -2.8% change is broadly in line with the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a greater proportion of students achieved the top grades in <em>Art and design subjects</em> in 2017 compared to all A-Level subjects. A total of 82.4% of pupils achieved A*-C grades in <em>Art and design subjects</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "BIOL",
        "analysis": "<p>Entries in <em>Biology</em> have decreased a little across the UK over the last four years. The -3.4% change is broadly in line with the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a smaller proportion of students achieved the top grades in <em>Biology</em> in 2017 compared to all A-Level subjects. A total of 70.8% of pupils achieved A*-C grades in <em>Biology</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "BUSS",
        "analysis": "<p>Entries in <em>Business studies</em> have increased a little across the UK over the last four years. The 12.3% change is greater than the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a smaller proportion of students achieved the top grades in <em>Business studies</em> in 2017 compared to all A-Level subjects. A total of 74.7% of pupils achieved A*-C grades in <em>Business studies</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "CHEM",
        "analysis": "<p>Entries in <em>Chemistry</em> have decreased a little across the UK over the last four years. The -2.2% change is broadly in line with the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a broadly similar proportion of students achieved the top grades in <em>Chemistry</em> in 2017 as did so across all A-Level subjects. A total of 75.6% of pupils achieved A*-C grades in <em>Chemistry</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "CLAS",
        "analysis": "<p>Entries in <em>Classical subjects</em> have decreased a little across the UK over the last four years. The -2.8% change is broadly in line with the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a greater proportion of students achieved the top grades in <em>Classical subjects</em> in 2017 compared to all A-Level subjects. A total of 86.2% of pupils achieved A*-C grades in <em>Classical subjects</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "COMM",
        "analysis": "<p>Entries in <em>Communication studies</em> have decreased a little across the UK over the last four years. The -11.7% change is smaller than the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a greater proportion of students achieved the top grades in <em>Communication studies</em> in 2017 compared to all A-Level subjects. A total of 85.5% of pupils achieved A*-C grades in <em>Communication studies</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "COMP",
        "analysis": "<p>Entries in <em>Computing</em> have increased sharply across the UK over the last four years. The 99.0% change is greater than the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a smaller proportion of students achieved the top grades in <em>Computing</em> in 2017 compared to all A-Level subjects. A total of 61.2% of pupils achieved A*-C grades in <em>Computing</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "CRIT",
        "analysis": "<p>Entries in <em>Critical thinking</em> have decreased sharply across the UK over the last four years. The -91.5% change is smaller than the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a smaller proportion of students achieved the top grades in <em>Critical thinking</em> in 2017 compared to all A-Level subjects. A total of 55.6% of pupils achieved A*-C grades in <em>Critical thinking</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "DEST",
        "analysis": "<p>Entries in <em>Design and technology</em> have decreased a little across the UK over the last four years. The -9.3% change is smaller than the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a smaller proportion of students achieved the top grades in <em>Design and technology</em> in 2017 compared to all A-Level subjects. A total of 68.4% of pupils achieved A*-C grades in <em>Design and technology</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "DRAM",
        "analysis": "<p>Entries in <em>Drama</em> have decreased a little across the UK over the last four years. The -8.9% change is smaller than the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a broadly similar proportion of students achieved the top grades in <em>Drama</em> in 2017 as did so across all A-Level subjects. A total of 79.1% of pupils achieved A*-C grades in <em>Drama</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "ECON",
        "analysis": "<p>Entries in <em>Economics</em> have increased a little across the UK over the last four years. The 13.0% change is greater than the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a greater proportion of students achieved the top grades in <em>Economics</em> in 2017 compared to all A-Level subjects. A total of 83.2% of pupils achieved A*-C grades in <em>Economics</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "ENLA",
        "analysis": "<p>Entries in <em>English language</em> have stayed the same across the UK over the last four years. The 0.0% change is broadly in line with the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a smaller proportion of students achieved the top grades in <em>English language</em> in 2017 compared to all A-Level subjects. A total of 74.2% of pupils achieved A*-C grades in <em>English language</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "ENLI",
        "analysis": "<p>Entries in <em>English literature</em> have stayed the same across the UK over the last four years. The 0.0% change is broadly in line with the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a greater proportion of students achieved the top grades in <em>English literature</em> in 2017 compared to all A-Level subjects. A total of 80.5% of pupils achieved A*-C grades in <em>English literature</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "ENLL",
        "analysis": "<p>Entries in <em>English language and literature</em> have stayed the same across the UK over the last four years. The 0.0% change is broadly in line with the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a smaller proportion of students achieved the top grades in <em>English language and literature</em> in 2017 compared to all A-Level subjects. A total of 74.7% of pupils achieved A*-C grades in <em>English language and literature</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "FREN",
        "analysis": "<p>Entries in <em>French</em> have decreased a little across the UK over the last four years. The -9.2% change is smaller than the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a greater proportion of students achieved the top grades in <em>French</em> in 2017 compared to all A-Level subjects. A total of 84.5% of pupils achieved A*-C grades in <em>French</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "GENS",
        "analysis": "<p>Entries in <em>General studies</em> have decreased sharply across the UK over the last four years. The -70.1% change is smaller than the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a smaller proportion of students achieved the top grades in <em>General studies</em> in 2017 compared to all A-Level subjects. A total of 58.3% of pupils achieved A*-C grades in <em>General studies</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "GEOG",
        "analysis": "<p>Entries in <em>Geography</em> have increased a little across the UK over the last four years. The 14.6% change is greater than the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a greater proportion of students achieved the top grades in <em>Geography</em> in 2017 compared to all A-Level subjects. A total of 81.8% of pupils achieved A*-C grades in <em>Geography</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "GERM",
        "analysis": "<p>Entries in <em>German</em> have decreased a little across the UK over the last four years. The -12.5% change is smaller than the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a greater proportion of students achieved the top grades in <em>German</em> in 2017 compared to all A-Level subjects. A total of 87.4% of pupils achieved A*-C grades in <em>German</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "HIST",
        "analysis": "<p>Entries in <em>History</em> have decreased a little across the UK over the last four years. The -3.5% change is broadly in line with the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a greater proportion of students achieved the top grades in <em>History</em> in 2017 compared to all A-Level subjects. A total of 82.6% of pupils achieved A*-C grades in <em>History</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "ICTX",
        "analysis": "<p>Entries in <em>ICT</em> have decreased a little across the UK over the last four years. The -19.7% change is smaller than the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a smaller proportion of students achieved the top grades in <em>ICT</em> in 2017 compared to all A-Level subjects. A total of 58.6% of pupils achieved A*-C grades in <em>ICT</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "IRIS",
        "analysis": "<p>Entries in <em>Irish</em> have increased a little across the UK over the last four years. The 6.4% change is greater than the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a greater proportion of students achieved the top grades in <em>Irish</em> in 2017 compared to all A-Level subjects. A total of 95.5% of pupils achieved A*-C grades in <em>Irish</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "LAWX",
        "analysis": "<p>Entries in <em>Law</em> have increased a little across the UK over the last four years. The 0.2% change is broadly in line with the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a smaller proportion of students achieved the top grades in <em>Law</em> in 2017 compared to all A-Level subjects. A total of 71.4% of pupils achieved A*-C grades in <em>Law</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "MATH",
        "analysis": "<p>Entries in <em>Mathematics</em> have increased a little across the UK over the last four years. The 7.2% change is greater than the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a greater proportion of students achieved the top grades in <em>Mathematics</em> in 2017 compared to all A-Level subjects. A total of 80.3% of pupils achieved A*-C grades in <em>Mathematics</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "MATF",
        "analysis": "<p>Entries in <em>Further mathematics</em> have increased a little across the UK over the last four years. The 15.3% change is greater than the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a greater proportion of students achieved the top grades in <em>Further mathematics</em> in 2017 compared to all A-Level subjects. A total of 88.2% of pupils achieved A*-C grades in <em>Further mathematics</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "MFTS",
        "analysis": "<p>Entries in <em>Media/film/TV studies</em> have decreased a little across the UK over the last four years. The -5.4% change is broadly in line with the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a greater proportion of students achieved the top grades in <em>Media/film/TV studies</em> in 2017 compared to all A-Level subjects. A total of 81.0% of pupils achieved A*-C grades in <em>Media/film/TV studies</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "MUSI",
        "analysis": "<p>Entries in <em>Music</em> have decreased sharply across the UK over the last four years. The -23.2% change is smaller than the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a smaller proportion of students achieved the top grades in <em>Music</em> in 2017 compared to all A-Level subjects. A total of 72.6% of pupils achieved A*-C grades in <em>Music</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "PERF",
        "analysis": "<p>Entries in <em>Performing/expressive arts</em> have decreased sharply across the UK over the last four years. The -23.5% change is smaller than the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a greater proportion of students achieved the top grades in <em>Performing/expressive arts</em> in 2017 compared to all A-Level subjects. A total of 85.3% of pupils achieved A*-C grades in <em>Performing/expressive arts</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "PHED",
        "analysis": "<p>Entries in <em>Physical education</em> have decreased a little across the UK over the last four years. The -12.7% change is smaller than the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a smaller proportion of students achieved the top grades in <em>Physical education</em> in 2017 compared to all A-Level subjects. A total of 65.3% of pupils achieved A*-C grades in <em>Physical education</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "PHYS",
        "analysis": "<p>Entries in <em>Physics</em> have decreased a little across the UK over the last four years. The -0.3% change is broadly in line with the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a smaller proportion of students achieved the top grades in <em>Physics</em> in 2017 compared to all A-Level subjects. A total of 69.7% of pupils achieved A*-C grades in <em>Physics</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "POLS",
        "analysis": "<p>Entries in <em>Political studies</em> have increased sharply across the UK over the last four years. The 27.3% change is greater than the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a broadly similar proportion of students achieved the top grades in <em>Political studies</em> in 2017 as did so across all A-Level subjects. A total of 79.8% of pupils achieved A*-C grades in <em>Political studies</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "PSYC",
        "analysis": "<p>Entries in <em>Psychology</em> have increased a little across the UK over the last four years. The 7.0% change is greater than the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a smaller proportion of students achieved the top grades in <em>Psychology</em> in 2017 compared to all A-Level subjects. A total of 73.5% of pupils achieved A*-C grades in <em>Psychology</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "RELS",
        "analysis": "<p>Entries in <em>Religious studies</em> have increased a little across the UK over the last four years. The 7.7% change is greater than the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a greater proportion of students achieved the top grades in <em>Religious studies</em> in 2017 compared to all A-Level subjects. A total of 80.8% of pupils achieved A*-C grades in <em>Religious studies</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "SOCI",
        "analysis": "<p>Entries in <em>Sociology</em> have increased a little across the UK over the last four years. The 13.1% change is greater than the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a broadly similar proportion of students achieved the top grades in <em>Sociology</em> in 2017 as did so across all A-Level subjects. A total of 77.3% of pupils achieved A*-C grades in <em>Sociology</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "SPAN",
        "analysis": "<p>Entries in <em>Spanish</em> have increased a little across the UK over the last four years. The 13.2% change is greater than the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a greater proportion of students achieved the top grades in <em>Spanish</em> in 2017 compared to all A-Level subjects. A total of 86.4% of pupils achieved A*-C grades in <em>Spanish</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "WELF",
        "analysis": "<p>Entries in <em>Welsh: first language</em> have stayed the same across the UK over the last four years. The 0.0% change is broadly in line with the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a greater proportion of students achieved the top grades in <em>Welsh: first language</em> in 2017 compared to all A-Level subjects. A total of 84.1% of pupils achieved A*-C grades in <em>Welsh: first language</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "WELS",
        "analysis": "<p>Entries in <em>Welsh: second language</em> have stayed the same across the UK over the last four years. The 0.0% change is broadly in line with the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a smaller proportion of students achieved the top grades in <em>Welsh: second language</em> in 2017 compared to all A-Level subjects. A total of 63.7% of pupils achieved A*-C grades in <em>Welsh: second language</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "OMFL",
        "analysis": "<p>Entries in <em>Other modern languages</em> have increased a little across the UK over the last four years. The 4.2% change is broadly in line with the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a greater proportion of students achieved the top grades in <em>Other modern languages</em> in 2017 compared to all A-Level subjects. A total of 92.2% of pupils achieved A*-C grades in <em>Other modern languages</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "OSCI",
        "analysis": "<p>Entries in <em>Other sciences</em> have decreased a little across the UK over the last four years. The -18.5% change is smaller than the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a broadly similar proportion of students achieved the top grades in <em>Other sciences</em> in 2017 as did so across all A-Level subjects. A total of 77.7% of pupils achieved A*-C grades in <em>Other sciences</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "AOTH",
        "analysis": "<p>Entries in <em>All other subjects</em> have decreased a little across the UK over the last four years. The -12.4% change is smaller than the overall change, of -0.7%, in all A-Level entries over the last four years.</p><p>Across the UK, a smaller proportion of students achieved the top grades in <em>All other subjects</em> in 2017 compared to all A-Level subjects. A total of 70.0% of pupils achieved A*-C grades in <em>All other subjects</em> compared to 77.4% for all subjects.</p>"
    },
    {
        "alias": "ALLS",
        "analysis": "<p>Entries in <em>All subjects</em> have decreased by 0.7% across the UK over the last four years. Across the UK, 77.4% of pupils achieved A*-C grades in <em>All subjects</em> in 2017.</p>"
    }
]